#IMPORTING LIBRARIES

In [ ]:
import pandas as pd
import numpy as np

#READING PDF FILES IN PYTHON

https://blog.ineuron.ai/Read-tables-from-PDF-into-DataFrame-qNAkcOxxN3

##EXPORT pdf tables to JSON, TSV, or CSV

tabula-py has capability to convert not only DataFrame but also JSON, TSV, or CSV. You can set output format with output_format option.

###Extracting tables from pdf file in json format
**tabula.read_pdf(pdf_file_path, output_format="json")**
###You can convert from pdf file into JSON file
**tabula.convert_into(pdf_file_path, "pdf_json.json", output_format="json")**
###Extracting pdf content in csv format and creating csv file
**tabula.convert_into(pdf_file_path, "pdf_csv.csv", output_format="csv", stream=True)**
###Extracting pdf content in tsv format and creating tsv file
**tabula.convert_into(pdf_file_path, "pdf_tsv.tsv", output_format="tsv")**

#IMPORTING PDF FILES

pip install tabula-py

In [ ]:
import tabula as tb

data = tb.read_pdf("2018.pdf",pages="all")

df=data[0]

# df

In [ ]:
df1=pd.DataFrame()

c=0
for i in range(len(data)):
  df2=data[c]
  df1=pd.concat([df1,df2],ignore_index=True)
  c+=1

df1

In [ ]:
df1.info()

In [ ]:
df1.insert(4,"YOP",value=2018)

In [ ]:
df1.info()

#EXPORTING PDF FILE DATA TO AN EXCEL FILE

In [ ]:
df1.to_excel("2018_new.xlsx")

#IMPORTING THE EXCEL FILES

In [ ]:
d1=pd.read_excel("2018_new.xlsx",index_col=0)
d2=pd.read_excel("2019_new.xlsx",index_col=0)
d3=pd.read_excel("2020_new.xlsx",index_col=0)
d4=pd.read_excel("2021_new.xlsx",index_col=0)
d5=pd.read_excel("2022_new.xlsx",index_col=0)

In [ ]:
d1.info()
d2.info()
d3.info()
d4.info()
d5.info()

In [ ]:
d5.columns

#Dropping the Gender column from d5

In [ ]:
d5.drop("Gender",inplace=True,axis=1) #axis=1 or "columns" & axis=0 or "rows"

In [ ]:
d5.columns

Index(['Sl No', 'Regd No', 'Name of the Student', 'Branch', 'YOP',
       'Name of the Companies', 'CTC (L.P.A)'],
      dtype='object')

#Renaming Columns

In [ ]:
d1.columns=d2.columns=d3.columns=d4.columns=d5.columns=["S.NO",'Roll Number',"Name","Branch","YOP","Company","CTC"]

#Combining data frames into a single dataframe

In [ ]:
new_df=pd.concat([d1,d2,d3,d4,d5],ignore_index=True)
new_df

,S.NO,Roll Number,Name,Branch,YOP,Company,CTC
0,1,314126502002,Allu Avinash,B.Tech - Chem,2018,CONCENTRIX,2.00LPA
1,2,314126502004,Balivada Anusha Saroja,B.Tech - Chem,2018,Amazon India,12.00 LPA
2,3,314126502005,Chukka Bhaskar,B.Tech - Chem,2018,Deccan Fine Chemical,3.41LPA
3,4,314126502012,K. Yamini Swetha,B.Tech - Chem,2018,Amazon India,12.00 LPA
4,5,314126502016,Nandigam Ram Prasad,B.Tech - Chem,2018,Deccan Fine Chemical,3.41LPA
...,...,...,...,...,...,...,...
4593,1643,319126502L14,Mansoor Hussain Shaik,CHEM,2022,HETERO,2.19
4594,1644,319126502L16,Narayana Murthy Yelamanchili,CHEM,2022,HETERO,2.19
4595,1645,319126502L17,Mutyala Naidu Kothalanka,CHEM,2022,HETERO,2.19
4596,1646,319126502L19,Efraim Devarapalli,CHEM,2022,HETERO,2.19
4597,1647,318126508039,Prasad Bhanu Siraparapu,Civil,2022,Rockeira,2.16

#Extracting new dataframe to excel

In [ ]:
new_df.to_excel("ANITS PLACEMENTS CONSOLIDATED.xlsx",index=False)

#CHANGING DATA TYPE OF "ROLL NO" COLUMN TO STR

In [ ]:
new_data=pd.read_excel("ANITS PLACEMENTS CONSOLIDATED.xlsx",dtype={'Roll Number' :str})

In [ ]:
new_data

# Using DataFrame.insert() to add a column
**df.insert(2, "Age", [21, 23, 24, 21], True)**

In [ ]:
new_data.insert(4,"College",value="ANITS")

In [ ]:
new_data.insert(5,"Placement Status",value="SELECTED")

In [ ]:
new_data

In [ ]:
new_data.columns

#ALTERING THE COLUMNS

In [ ]:
# altering the DataFrame
new_data = new_data[['S.NO','Roll Number', 'Name', 'Branch','College','YOP','Placement Status','Company','CTC']]

In [ ]:
new_data.to_excel("ANITS PLACEMENTS CONSOLIDATED CLEANED.xlsx",index=False)